Catalogs/усд_МаршрутыДвиженияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>усд_МаршрутыДвиженияДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_ВидыДокументов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БлокироватьПриЗавершении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратНаПересмотрНаПроизвольныйЭтап</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масштабирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗаполненияКонтролируемыхРеквизитов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.усд_ПорядкиЗаполненияКонтролируемыхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерШрифта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПопаданияНаМаршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_УсловияВыполненияОперацийПоДокументам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинальноеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинальныйКонтрольРеквизитовДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаБлока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаБлока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасстояниеМеждуЭтапами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СимволовВСтроке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВозвратаНаПересмотр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.усд_РежимыВозвратаДокументовНаПересмотр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПродолженияМаршрутаПриПересмотре</Name>
					<Type>
						<v8:Type>cfg:EnumRef.усд_ПравилаПродолженияМаршрутаПриПересмотре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтролируемыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРеквизитаИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницыВремени</Name>
							<Type>
								<v8:Type>cfg:EnumRef.усд_ЕдиницыИзмеренияВремениИсполненияЗадачСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретитьПроведениеДокументаНаДанномЭтапе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьСрокИсполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректироватьРеквизитыДокумента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьПодписиВсехОтветственных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПровестиАвтоматическиПриУтверждении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_СостоянияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПриВозврате</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_СостоянияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПриОтклонении</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_СостоянияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеАвтодействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_УсловияВыполненияОперацийПоДокументам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеПримененияЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_УсловияВыполненияОперацийПоДокументам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПереходыПоЭтапам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПриемник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Безусловный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_УсловияВыполненияОперацийПоДокументам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПереченьПереходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КорректировкаРеквизитовНаЭтапах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКонтролируемогоРеквизита</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректируемыйРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/усд_ПраваПодписиНаЭтапахМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>усд_ПраваПодписиНаЭтапахМаршрутов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_МаршрутыДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ГруппыСогласованияДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/усд_МаршрутыДвиженияДокументов/Ext/ObjectModule.bsl
//Процедура ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка=Истина Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПраваПодписиНаЭтапахМаршрутов.ВидДокументов,
	               |	ПраваПодписиНаЭтапахМаршрутов.Маршрут,
	               |	ПраваПодписиНаЭтапахМаршрутов.Этап
	               |ИЗ
	               |	РегистрСведений.усд_ПраваПодписиНаЭтапахМаршрутов КАК ПраваПодписиНаЭтапахМаршрутов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.усд_МаршрутыДвиженияДокументов.ЭтапыМаршрута КАК МаршрутыДвиженияДокументовЭтапыМаршрута
	               |		ПО ПраваПодписиНаЭтапахМаршрутов.Этап = МаршрутыДвиженияДокументовЭтапыМаршрута.Этап
	               |			И ПраваПодписиНаЭтапахМаршрутов.Маршрут = МаршрутыДвиженияДокументовЭтапыМаршрута.Ссылка
	               |			И ПраваПодписиНаЭтапахМаршрутов.ВидДокументов = МаршрутыДвиженияДокументовЭтапыМаршрута.Ссылка.Владелец
	               |ГДЕ
	               |	МаршрутыДвиженияДокументовЭтапыМаршрута.Ссылка = &Ссылка
	               |	И МаршрутыДвиженияДокументовЭтапыМаршрута.НомерСтроки ЕСТЬ NULL 
	               |	И ПраваПодписиНаЭтапахМаршрутов.Маршрут = &Ссылка";
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 НаборЗаписей = РегистрыСведений.усд_ПраваПодписиНаЭтапахМаршрутов.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.ВидДокументов.Установить(Выборка.ВидДокументов);
		 НаборЗаписей.Отбор.Маршрут.Установить(Выборка.Маршрут);
		 НаборЗаписей.Отбор.Этап.Установить(Выборка.Этап);
		 НаборЗаписей.Прочитать();
		 НаборЗаписей.Очистить();
		 НаборЗаписей.Записать();
	 КонецЦикла;
	 СтрокиУдалить = Новый Массив;
	 Для Каждого СтрокаУдалить Из ПереходыПоЭтапам.НайтиСтроки(Новый Структура("ЭтапИсточник,ЭтапПриемник",Неопределено,Неопределено)) Цикл
		СтрокиУдалить.Добавить(СтрокаУдалить);
	 КонецЦикла;
	 Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
		 ПереходыПоЭтапам.Удалить(СтрокаУдалить);
	 КонецЦикла;
	 СписокУдалить = Новый Массив;
	 Для Каждого СтрокаКонтроля Из КонтролируемыеРеквизиты Цикл
		 Если СтрокаКонтроля.Этап.Пустая() ИЛИ ЭтапыМаршрута.НайтиСтроки(Новый Структура("Этап",СтрокаКонтроля.Этап)).Количество()=0 Тогда
			 СписокУдалить.Добавить(СтрокаКонтроля);
		 КонецЕсли;
	 КонецЦикла;
	 Для Каждого СтрокаКонтроля Из СписокУдалить Цикл
		 КонтролируемыеРеквизиты.Удалить(СтрокаКонтроля);
	 КонецЦикла;
	 Для Каждого СтрокаЭтап Из ЭтапыМаршрута Цикл
		 Если ПереходыПоЭтапам.НайтиСтроки(Новый Структура("ЭтапИсточник,ЭтапПриемник",СтрокаЭтап.Этап,Неопределено)).Количество()>0 Тогда
			 Если СтрокаЭтап.ЗапретитьПроведениеДокументаНаДанномЭтапе Тогда 
				 Отказ = Истина;
				 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как для последнего этапа """+СтрокаЭтап.Этап+""" запрещено проведение документов!
				 |				Последний этап маршрута должен разрешать проведение документов!");
			 КонецЕсли;
		 КонецЕсли;
	 КонецЦикла;
	 Если ПереходыПоЭтапам.НайтиСтроки(Новый Структура("ЭтапИсточник",Неопределено)).Количество()>1 Тогда
		 Отказ = Истина;
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как имеется несколько стартовых этапов!");
	 КонецЕсли;
	 СтрокиАвтоматическоеЗавершение = ЭтапыМаршрута.НайтиСтроки(Новый Структура("Этап",Справочники.усд_ЭтапыМаршрутовДвиженияДокументов.ПустаяСсылка()));
	 Если СтрокиАвтоматическоеЗавершение.Количество() > 0 Тогда
		 Отказ = Истина;
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как для следующих строк не указан этап:");
		 Для Каждого СтрокаЗавершение Из СтрокиАвтоматическоеЗавершение Цикл
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("		-"+Строка(СтрокаЗавершение.НомерСтроки));
		 КонецЦикла;
	 КонецЕсли;
	 Если НЕ Отказ Тогда
		 Этапы = ЭтапыМаршрута.Выгрузить();
		 Этапы.Свернуть("Этап");
		 Если Этапы.Количество() <> ЭтапыМаршрута.Количество() Тогда
			 Отказ = Истина;
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как имеются повторяющиеся этапы!");
		 КонецЕсли;
		 Для Каждого СтрокаЭтап Из ЭтапыМаршрута Цикл
			 Если СтрокаЭтап.Этап = Справочники.усд_ЭтапыМаршрутовДвиженияДокументов.ВозвратИнициаторуМаршрута Тогда
				 Отказ = Истина;
				 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как в строке №"+Строка(СтрокаЭтап.НомерСтроки)+" указан этап ""Возврат инициатору маршрута"",который не может быть использован как основной этап!");
			 КонецЕсли;
			 Если ВозвратНаПересмотрНаПроизвольныйЭтап Тогда
				 ЭтапВозврата = СтрокаЭтап.ЭтапВозврата;
				 Если ЭтапВозврата = СтрокаЭтап.Этап Тогда
					 Отказ = Истина;
					 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как в строке №"+Строка(СтрокаЭтап.НомерСтроки)+" указан этап возврата, идентичный основному!");
				 КонецЕсли;
				 Если ЭтапВозврата <> Справочники.усд_ЭтапыМаршрутовДвиженияДокументов.ВозвратИнициаторуМаршрута Тогда
					 СтрокиЭтапа = ЭтапыМаршрута.НайтиСтроки(Новый Структура("Этап",ЭтапВозврата));
					 Если СтрокиЭтапа.Количество() =0 Тогда
						 Отказ = Истина;
						 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как в строке №"+Строка(СтрокаЭтап.НомерСтроки)+" указан этап возврата, не входящий в состав маршрута!");
					 Иначе	 
						 Если ЭтапыМаршрута.Индекс(СтрокиЭтапа[0]) >= ЭтапыМаршрута.Индекс(СтрокаЭтап) Тогда
							 Отказ = Истина;
							 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как в строке №"+Строка(СтрокаЭтап.НомерСтроки)+" указан этап возврата, находящийся позже основного!");
						 КонецЕсли;
					 КонецЕсли;
				 КонецЕсли;
			 КонецЕсли;
		 КонецЦикла;
	 КонецЕсли;
	 Если УсловиеПопаданияНаМаршрут.Пустая() И НЕ ИспользоватьПоУмолчанию Тогда
		 Отказ = Истина;
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Маршрут не записан, так как не указано условие использования маршрута!");
	 КонецЕсли;
КонецПроцедуры //ПередЗаписью

Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(Владелец) И (НЕ ПометкаУдаления) И усд_ПроцедурыСогласованияВызовСервераПовтИсп.ИспользуетсяСогласованиеДокумента(Владелец)=Ложь Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры
